app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "artists".* FROM "artists"
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      @has_artist_id = true
      artist = Artist.find_by(id: params[:artist_id])
      if artist.present?
        @song = artist.songs.find_by(id: params[:id])